#
# クライアント共有定数モジュール
#
module Unlight
  # ============== AVATAR関連定数 ==================
  #                   0   1   2   3   4    5    6    7     8     9    10
  LEVEL_EXP_TABLE = [
    0, # 1
    10,       # 2
    30,       # 3
    60,       # 4
    105,      # 5
    165,      # 6
    240,      # 7
    330,      # 8
    440,      # 9
    570,      # 10
    720,      # 11
    900,      # 12
    1110,     # 13
    1350,     # 14
    1620,     # 15
    1920,     # 16
    2260,     # 17
    2640,     # 18
    3060,     # 19
    3520,     # 20
    4020,     # 21
    4570,     # 22
    5170,     # 23
    5820,     # 24
    6520,     # 25
    7290,     # 26
    8130,    # 27
    9040,    # 28
    10_020,   # 29
    11_070,   # 30
    12_190,   # 31
    13_390,   # 32
    14_670,   # 33
    16_030,   # 34
    17_470,   # 35
    18_990,   # 36
    20_590,   # 37
    22_290,   # 38
    24_090,    # 39
    25_990,    # 40
    27_990,    # 41
    30_090,    # 42
    32_290,    # 43
    34_590,    # 44
    37_040,    # 45
    39_640,    # 46
    42_390,    # 47
    45_290,    # 48
    48_340,    # 49
    51_540,    # 50
    54_940,    # 51
    58_540,    # 52
    62_340,    # 53
    66_340,    # 54
    70_540,    # 55
    75_040,    # 56
    79_840,    # 57
    84_940,    # 58
    90_340,    # 59
    96_040,    # 60
    102_240,    # 61
    108_940,    # 62
    116_140,    # 63
    123_840,    # 64
    132_040,    # 65
    140_940,    # 66
    150_540,    # 67
    160_840,    # 68
    171_840,    # 69
    183_540,    # 70
    195_940,    # 71
    209_040,    # 72
    222_840,    # 73
    237_340,    # 74
    252_540,    # 75
    268_440,    # 76
    285_040,    # 77
    302_340,    # 78
    320_340,    # 79
    339_040,    # 80
    358_440,    # 81
    378_540,    # 82
    399_340,    # 83
    420_840,    # 84
    443_040,    # 85
    465_940,    # 86
    489_540,    # 87
    513_840,    # 88
    538_840,    # 89
    564_540,    # 90
    590_940,    # 91
    618_040,    # 92
    645_840,    # 93
    674_340,    # 94
    703_540,    # 95
    733_440,    # 96
    764_040,    # 97
    795_340,    # 98
    827_340,    # 99
    860_040,    # 100
    893_980,    # 101
    929_480,    # 102
    967_480,    # 103
    1_008_300,   # 104
    1_052_050,   # 105
    1_098_550,   # 106
    1_147_470,   # 107
    1_199_320,   # 108
    1_253_890,   # 109
    1_311_180,   # 110
    1_371_190,   # 111
    1_433_920,   # 112
    1_499_370,   # 113
    1_567_530,   # 114
    1_638_400,   # 115
    1_711_980,   # 116
    1_788_270,   # 117
    1_867_270,   # 118
    1_948_970,   # 119
    2_033_370,   # 120
    2_120_470,   # 121
    2_210_270,   # 122
    2_302_750,   # 123
    2_397_910,   # 124
    2_495_750,   # 125
    2_596_270,   # 126
    2_699_470,   # 127
    2_805_350,   # 128
    2_913_900,   # 129
    3_025_120,   # 130
    3_139_010,   # 131
    3_255_570,   # 132
    3_374_800,   # 133
    3_496_700,   # 134
    3_621_250,   # 135
    3_748_450,   # 136
    3_878_300,   # 137
    4_010_800,   # 138
    4_145_950,   # 139
    4_283_750,   # 140
    4_424_200,   # 141
    4_567_250,   # 142
    4_712_900,   # 143
    4_861_150,   # 144
    5_012_000,   # 145
    5_165_450,   # 146
    5_321_500,   # 147
    5_480_100,   # 148
    5_641_250,   # 149
    5_804_950,   # 150
    9_999_999_999, # 151 # 2014/03/03 151にならないよう一時的処置 yamagishi
    # 5971200,   # 151
  ]

  LEVEL_ENG_BOUNUS = [
    0, # 1
    1,        # 2
    0,        # 3
    1,        # 4
    0,        # 5
    1,        # 6
    0,        # 7
    1,        # 8
    0,        # 9
    1,        # 10
    0,        # 11
    0,        # 12
    1,        # 13
    0,        # 14
    0,        # 15
    0,        # 16
    1,        # 17
    0,        # 18
    0,        # 19
    0,        # 20
    1,        # 21
    0,        # 22
    0,        # 23
    0,        # 24
    0,        # 25
    1,        # 26
    0,        # 27
    0,        # 28
    0,        # 29
    0,        # 30
    1,        # 31
    0,        # 32
    0,        # 33
    0,        # 34
    0,        # 35
    1,        # 36
    0,        # 37
    0,        # 38
    0,        # 39
    0,        # 40
    1,        # 41
    0,        # 42
    0,        # 43
    0,        # 44
    0,        # 45
    1,        # 46
    0,        # 47
    0,        # 48
    0,        # 49
    0,        # 50
    1,        # 51
    0,        # 52
    0,        # 53
    0,        # 54
    0,        # 55
    1,        # 56
    0,        # 57
    0,        # 58
    0,        # 59
    0,        # 60
    1,        # 61
    0,        # 62
    0,        # 63
    0,        # 64
    0,        # 65
    1,        # 66
    0,        # 67
    0,        # 68
    0,        # 69
    0,        # 70
    0,        # 71
    0,        # 72
    1,        # 73
    0,        # 74
    0,        # 75
    0,        # 76
    0,        # 77
    0,        # 78
    0,        # 79
    1,        # 80
    0,        # 81
    0,        # 82
    0,        # 83
    0,        # 84
    0,        # 85
    0,        # 86
    0,        # 87
    0,        # 88
    0,        # 89
    1,        # 90
    0,        # 91
    0,        # 92
    0,        # 93
    0,        # 94
    0,        # 95
    0,        # 96
    0,        # 97
    0,        # 98
    0,        # 99
    1,   # 100
    0,   # 101
    0,   # 102
    0,   # 103
    0,   # 104
    0,   # 105
    0,   # 106
    0,   # 107
    0,   # 108
    0,   # 109
    1,   # 110
    0,   # 111
    0,   # 112
    0,   # 113
    0,   # 114
    0,   # 115
    0,   # 116
    0,   # 117
    0,   # 118
    0,   # 119
    1,   # 120
    0,   # 121
    0,   # 122
    0,   # 123
    0,   # 124
    0,   # 125
    0,   # 126
    0,   # 127
    0,   # 128
    0,   # 129
    1,   # 130
    0,   # 131
    0,   # 132
    0,   # 133
    0,   # 134
    0,   # 135
    0,   # 136
    0,   # 137
    0,   # 138
    0,   # 139
    1,   # 140
    0,   # 141
    0,   # 142
    0,   # 143
    0,   # 144
    0,   # 145
    0,   # 146
    0,   # 147
    0,   # 148
    0,   # 149
    1,   # 150
  ]

  LEVEL_FRND_BOUNUS = [
    0, # 1
    1,        # 2
    0,        # 3
    1,        # 4
    0,        # 5
    1,        # 6
    0,        # 7
    1,        # 8
    0,        # 9
    1,        # 10
    0,        # 11
    0,        # 12
    1,        # 13
    0,        # 14
    0,        # 15
    0,        # 16
    1,        # 17
    0,        # 18
    0,        # 19
    0,        # 20
    1,        # 21
    0,        # 22
    0,        # 23
    0,        # 24
    0,        # 25
    1,        # 26
    0,        # 27
    0,        # 28
    0,        # 29
    0,        # 30
    1,        # 31
    0,        # 32
    0,        # 33
    0,        # 34
    0,        # 35
    1,        # 36
    0,        # 37
    0,        # 38
    0,        # 39
    0,        # 40
    1,        # 41
    0,        # 42
    0,        # 43
    0,        # 44
    0,        # 45
    1,        # 46
    0,        # 47
    0,        # 48
    0,        # 49
    0,        # 50
    1,        # 51
    0,        # 52
    0,        # 53
    0,        # 54
    0,        # 55
    1,        # 56
    0,        # 57
    0,        # 58
    0,        # 59
    0,        # 60
    1,        # 61
    0,        # 62
    0,        # 63
    0,        # 64
    0,        # 65
    1,        # 66
    0,        # 67
    0,        # 68
    0,        # 69
    0,        # 70
    0,        # 71
    0,        # 72
    1,        # 73
    0,        # 74
    0,        # 75
    0,        # 76
    0,        # 77
    0,        # 78
    0,        # 79
    1,        # 80
    0,        # 81
    0,        # 82
    0,        # 83
    0,        # 84
    0,        # 85
    0,        # 86
    0,        # 87
    0,        # 88
    0,        # 89
    1,        # 90
    0,        # 91
    0,        # 92
    0,        # 93
    0,        # 94
    0,        # 95
    0,        # 96
    0,        # 97
    0,        # 98
    0,        # 99
    1,   # 100
    0,   # 101
    0,   # 102
    0,   # 103
    0,   # 104
    0,   # 105
    0,   # 106
    0,   # 107
    0,   # 108
    0,   # 109
    1,   # 110
    0,   # 111
    0,   # 112
    0,   # 113
    0,   # 114
    0,   # 115
    0,   # 116
    0,   # 117
    0,   # 118
    0,   # 119
    1,   # 120
    0,   # 121
    0,   # 122
    0,   # 123
    0,   # 124
    0,   # 125
    0,   # 126
    0,   # 127
    0,   # 128
    0,   # 129
    1,   # 130
    0,   # 131
    0,   # 132
    0,   # 133
    0,   # 134
    0,   # 135
    0,   # 136
    0,   # 137
    0,   # 138
    0,   # 139
    1,   # 140
    0,   # 141
    0,   # 142
    0,   # 143
    0,   # 144
    0,   # 145
    0,   # 146
    0,   # 147
    0,   # 148
    0,   # 149
    1,   # 150
  ]

  DECK_LEVEL_EXP_TABLE = [
    0, # 1
    260, # 2
    520, # 3
    780, # 4
    1410, # 5
    1850, # 6
    2380, # 7
    3420, # 8
    4210, # 9
    5120, # 10
    6760, # 11
    8030, # 12
    9480, # 13
    11_790, # 14
    13_670, # 15
    15_760, # 16
    18_880, # 17
    21_490, # 18
    24_360, # 19
    28_690, # 20
    32_290, # 21
    36_260, # 22
    42_320, # 23
    47_330, # 24
    52_860, # 25
    61_770, # 26
    68_990, # 27
    77_060, # 28
    90_820, # 29
    101_730, # 30
    114_060, # 31
    133_860, # 32
    149_930, # 33
    167_860, # 34
    193_260, # 35
    214_930, # 36
    238_460, # 37
    269_460, # 38
    296_730, # 39
    325_860, # 40
    362_460, # 41
    395_330, # 42
    430_060, # 43
    472_260, # 44
    510_730, # 45
    551_060, # 46
    604_280, # 47
    651_060, # 48
    701_060, # 49
    779_280, # 50
    843_390, # 51
    914_560, # 52
    1_015_060, # 53
    1_100_890, # 54
    1_194_060, # 55
    1_316_560, # 56
    1_424_390, # 57
    1_539_560, # 58
    1_679_170, # 59
    1_806_560, # 60
    1_940_060, # 61
    2_083_340, # 62
    2_221_730, # 63
    2_362_560, # 64
    2_513_170, # 65
    2_658_890, # 66
    2_807_060, # 67
    2_965_000, # 68
    3_118_060, # 69
    3_273_560, # 70
    3_438_840, # 71
    3_599_230, # 72
    3_762_060, # 73
    3_934_670, # 74
    4_102_390, # 75
    4_272_560, # 76
    4_452_500, # 77
    4_627_560, # 78
    4_805_060, # 79
    4_992_340, # 80
    5_174_730, # 81
    5_359_560, # 82
    5_554_170, # 83
    5_743_890, # 84
    5_936_060, # 85
    6_138_000, # 86
    6_335_060, # 87
    6_534_560, # 88
    6_743_840, # 89
    6_948_230, # 90
    7_155_060, # 91
    7_371_670, # 92
    7_583_390, # 93
    7_797_560, # 94
    8_021_500, # 95
    8_240_560, # 96
    8_462_060, # 97
    8_693_340, # 98
    8_919_730, # 99
    9_148_560, # 100
    9_387_170, # 101
    9_620_890, # 102
    9_857_060, # 103
    10_103_000, # 104
    10_344_060, # 105
    10_587_560, # 106
    10_840_840, # 107
    11_089_230, # 108
    11_340_060, # 109
    11_600_670, # 110
    11_856_390, # 111
    12_114_560, # 112
    12_382_500, # 113
    12_645_560, # 114
    12_911_060, # 115
    13_186_340, # 116
    13_456_730, # 117
    13_729_560, # 118
    14_012_170, # 119
    14_289_890, # 120
    14_570_060, # 121
    14_860_000, # 122
    15_145_060, # 123
    15_432_560, # 124
    15_729_840, # 125
    16_022_230, # 126
    16_317_060, # 127
    16_621_670, # 128
    16_921_390, # 129
    17_223_560, # 130
    17_535_500, # 131
    17_842_560, # 132
    18_152_060, # 133
    18_471_340, # 134
    18_785_730, # 135
    19_102_560, # 136
    19_429_170, # 137
    19_750_890, # 138
    20_075_060, # 139
    20_409_000, # 140
    20_738_060, # 141
    21_069_560, # 142
    21_410_840, # 143
    21_747_230, # 144
    22_086_060, # 145
    22_434_670, # 146
    22_778_390, # 147
    23_124_560, # 148
    24_717_600, # 149
    25_437_490, # 150
    999_999_999, # 151
  ]

  SC_LEVEL_EXP_TABLE = [
    0, # 001
    10,        # 002
    31,        # 003
    56,        # 004
    97,        # 005
    152,       # 006
    210,       # 007
    271,       # 008
    334,       # 009
    402,       # 010
    493,       # 011
    589,       # 012
    700,       # 013
    818,       # 014
    940,       # 015
    1083,      # 016
    1229,      # 017
    1402,      # 018
    1579,      # 019
    1770,      # 020
    999_999_999, # ***
  ]
  # CharaCardKind
  CC_KIND_CHARA         = 0
  CC_KIND_MONSTAR       = 1
  CC_KIND_COIN          = 2
  CC_KIND_TIPS          = 3
  CC_KIND_EX_COIN       = 4
  CC_KIND_EX_TIPS       = 5
  CC_KIND_BOSS_MONSTAR  = 6
  CC_KIND_PROFOUND_BOSS = 7
  CC_KIND_REBORN_CHARA  = 8
  CC_KIND_ORB           = 9
  CC_KIND_ARTIFACT     = 10
  CC_KIND_RARE_MONSTER = 11
  CC_KIND_RENTAL       = 12
  CC_KIND_EPISODE      = 13

  # 復活カード chara_card_idのオフセット値
  CC_ID_OFFSET_REBORN = 2000

  # 復活カード charactor_idのオフセット値
  CHARACTOR_ID_OFFSET_REBORN = 4000

  # AvatarPartsType
  APT_B_BODY   = 0
  APT_B_EYE    = 1
  APT_B_MOUTH  = 2
  APT_B_HAIR   = 3

  APT_C_TOP    = 10
  APT_C_BOTTOM = 11
  APT_C_DRESS  = 12
  APT_C_SHOES  = 13

  APT_A_HEAD   = 20
  APT_A_ARAMS  = 21
  APT_A_FACE   = 22

  # AvatarPartsType
  APT_BODY      = 10
  APT_CLOTHES   = 20
  APT_ACCESSORY = 30

  # AvatartPartsInventoryMax
  AP_INV_MAX = 30

  # アバターパーツの状態
  APS_USED      = 0b0001
  APS_ACTIVATED = 0b0010

  # CharaDeckType
  CDT_DUEL     = 0
  CDT_QUEST    = 1

  # CharaDeckStatus
  CDS_NONE    = 0               # 命令なし
  CDS_QUEST   = 1               # クエスト中
  CDS_SERCH   = 2               # 探索中
  CDS_RAID    = 3               # レイド中

  # FriendListの状態
  FR_ST_OTHER_CONFIRM = 0             # 相手の認証待ち
  FR_ST_MINE_CONFIRM  = 1             # 自分の認証待ち
  FR_ST_FRIEND        = 2             # フレンド
  FR_ST_BLOCK         = 3             # ブロックしている
  FR_ST_BLOCKED       = 4             # ブロックされている
  FR_ST_ONLY_SNS      = 5             # SNS上の友人
  FR_ST_LOGIN         = 6             # フレンドでかつログイン

  # 継続使用アイテム
  ITEM_USING_QUEST_MAX_UP   = 0      # クエストのインベントリ数のMAXのアップ中
  ITEM_USING_AP_RECOVERY_UP = 1      # AP回復スピード、上昇中
  ITEM_USING_BINDER_MAX_UP  = 2      # バインダーのカード枚数のマックスを上昇
  ITEM_USING_EXP_UP         = 3      # 獲得経験値UP
  ITEM_USING_PARTS_MAX_UP   = 4      # 獲得経験値UP

  # AvatarLevelUpInfo
  # [LEVEL, TYPE, VALUE]
  AVATAR_LEVEL_UP_INFO = []

  # ランキングのアロー
  RANK_NONE   = 0
  RANK_UP     = 1
  RANK_DOWN   = 2
  RANK_S_UP   = 3
  RANK_S_DOWN = 4

  RANK_TYPE_WD = 0
  RANK_TYPE_TD = 1
  RANK_TYPE_WQ = 2
  RANK_TYPE_TQ = 3
  RANK_TYPE_TE = 4
  RANK_TYPE_TV = 5

  RANK_SUPER_DIFF = 5

  # ============== ショップ関連定数 ==================
  SHOP_ITEM        = 0
  SHOP_PART        = 1
  SHOP_EVENT_CARD  = 2
  SHOP_WEAPON_CARD = 3
  SHOP_CHARA_CARD  = 4

  RM_ITEM_STATE_NORMAL            = 0
  RM_ITEM_STATE_NEW               = 1
  RM_ITEM_STATE_SALE              = 2
  RM_ITEM_STATE_RECOMMENDED       = 3
  RM_ITEM_STATE_NEW_RECOMMENDED   = 4
  RM_ITEM_STATE_SALE_RECOMMENDED  = 5

  # セールタイプ
  SALE_TYPE_ROOKIE  = 0
  SALE_TYPE_TEN     = 1
  SALE_TYPE_FIFTEEN = 2
  SALE_TYPE_TWENTY  = 3
  SALE_TYPE_THIRTY  = 4
  SALE_TYPE_FORTY   = 5
  SALE_TYPE_EVENT   = 6

  # ランダムセール時間
  RANDOM_SALE_TIME = 60 * 60 * 2 # ２時間
  #  RANDOM_SALE_TIME  = 60*3  #3分
  # ランダムセール発生確率 (1/14)
  RANDOM_SALE_PROBABILITY = 14
  # 1日セール時間
  ONE_DAY_SALE_TIME = 60 * 60 * 24 # 1日

  # デッキが含まれるID
  RM_ITEM_DECK_ID = [327, 2207, 3222]
  # デッキ増加アイテムID
  DECK_ITEM_ID = [85, 86, 87]

  # ============== レアカードくじ関連定数 ==================
  LOT_TYPE_BRONZE        = 0
  LOT_TYPE_SILVER        = 1
  LOT_TYPE_GOLD          = 2

  LOT_TIKECT_NUM = [1, 3, 5]

  # チケットの固有アイテム番号
  RARE_CARD_TICKET = 9

  # 複製アイテムの固有アイテム番号
  COPY_TICKET = 10

  #
  # ============== デッキ定数 ==================
  # 各ステージの仕様ACTION_CARDID

  STAGE_DECK = [
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57], # 0:STAGE_CASTLE
    [2, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     32, 34, 35, 36, 37, 38, 39, 40, 42, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 60], # 1:STAGE_FOREST
    [1, 2, 3, 4, 5, 6, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 36, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 60], # 2:STAGE_ROAD
    [1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23, 24, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 36, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 53, 54, 55, 56, 57, 59, 60], # 3:STAGE_LAKESIDE
    [1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 18, 19, 20, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 48, 49, 50, 52, 53, 54, 55, 56, 57, 60], # 4:STAGE_GRAVE
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58],  # 5:STAGE_VILLAGE
    [1, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 16, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 29, 30,
     31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 48, 49, 50, 51, 52, 53, 54, 55, 56, 58, 59, 60],  # 6:STAGE_WILD
    [1, 2, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 17, 18, 19, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 46, 47, 48, 49, 50, 51, 54, 55, 56, 57, 59, 60], # 7:STAGE_RUIN
    [3, 4, 5, 9, 10, 11, 12, 13, 14, 15, 18, 19, 20, 23, 24, 25, 26, 27, 28, 29, 30,
     33, 34, 35, 39, 40, 41, 42, 43, 44, 45, 48, 49, 50, 53, 54, 55, 56, 57, 58, 59, 60], # 8:STAGE_TOWN
    [1, 2, 3, 4, 5, 7, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 22, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 37, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 52, 55, 56, 57, 58, 59, 60], # 9:STAGE_MOUNTAIN
    [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60], # 10:STAGE_MOON_CASTLE
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 24, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60], # 11:STAGE_MOORLAND
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60],        # 12:STAGE_UBOS
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55,],       # 13:STAGE_STONE
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 29, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60],     # 14:STAGE_GATE
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 29, 30,
     31, 32, 33, 34, 35, 36, 37, 38, 39, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 58, 59, 60],     # 15:STAGE_THRONE
  ]

  DECK_COST_CORRECTION_CRITERIA = 7
  DECK_COST_CORRECTION_VALUE = 5

  # ステージの種類
  # 0:城ステージ，1:森ステージ,2:街道, 3:湖畔, 4:墓場,  5:村, 6:荒野, 7:遺跡, 8:街, 9:山, 10:幻影城, 11:荒地, 12:ウボス, 13:ストーンヘンジ, 14:凱旋門
  # 15:聖女の玉座
  # クイックマッチでは STAGE_GATE 以降を使用しない(2013/11/05)。マッチで使用可とするステージは GATE より前に挿入すること。
  STAGE_CASTLE, STAGE_FOREST, STAGE_ROAD, STAGE_LAKESIDE, STAGE_GRAVE, STAGE_VILLAGE, STAGE_WILD, STAGE_RUIN, STAG_TOWN, STAGE_MOUNTAIN, STAGE_MOON_CASTLE, STAGE_MOORLAND, STAGE_UBOS, STAGE_STONE, STAGE_GATE, STAGE_THRONE, STAGE_MAX = (0..15).to_a

  CHARA_CARD_DECK_MAX = 3

  # SlotType
  SCT_WEAPON = 0
  SCT_EQUIP  = 1
  SCT_EVENT = 2

  # EventCardColor
  ECC_NONE   = 0                # 属性スロット消費なし
  ECC_WHITE  = 1                # 属性スロットホワイト（幸運系）
  ECC_BLACK  = 2                # 属性スロットブラック（悪運系）
  ECC_RED    = 3                # 属性スロットレッド（近接攻撃系）
  ECC_GREEN  = 4                # 属性スロットグリーン（遠距離攻撃系）
  ECC_BLUE   = 5                # 属性スロットブルー（防御系）
  ECC_YELLOW = 6                # 属性スロットイエロー（特殊系）
  ECC_PURPLE = 7                # 属性スロットパープル（地形・移動系）

  # SlotMax
  SLOT_MAX_WEAPON = 1
  SLOT_MAX_EQUIP  = 1
  SLOT_MAX_EVENT  = 6

  # ============== クエスト関連定数 ==================
  QUEST_LOG_LIMIT = 20

  # 宝箱
  TG_NONE = 0
  TG_CHARA_CARD = 1
  TG_SLOT_CARD = 2
  TG_AVATAR_ITEM = 3
  TG_AVATAR_PART = 4
  TG_GEM = 5
  TG_OWN_CARD = 6
  TG_BONUS_GAME = 7

  # クエストイベントタイプ
  QE_NONE = 0
  QE_DAMAGE = 1
  QE_HEAL = 2

  # クエストタイプ
  QT_ADVENTURE = 0
  QT_TREASURE = 1
  QT_BOSS = 2

  # クエストマップの領域
  QMR_HEX_REALM = 0
  QMR_SHADOW_LAND = 1
  QMR_MOON_LAND = 2
  QMR_ANEMONEA = 3
  QMR_ANGEL_LAND = 4

  # ExShadowLand
  QM_EX_SHADOW_LAND = 101
  QM_EX_MOON_LAND = 102
  QM_EX_ANEMONEA = 103
  QM_EX_ANGEL_LAND = 105
  QM_EX_EVENT_LAND = 107

  # イベントクエスト
  QM_EV_XMAS_LAND = 201
  QM_EV_VALENTINE_LAND = 202
  QM_EV_WHITE_LAND = 203
  QM_EV_CODEX_LAND = 205
  QM_EV_ARK_LAND = 206
  QM_EV_ACOLYTE_LAND = 207
  QM_EV_2NDANNI1_LAND = 211
  QM_EV_2NDANNI2_LAND = 212
  QM_EV_2NDANNI3_LAND = 213
  QM_EV_XMAS2012_LAND = 214
  QM_EV_NEWYEAR2013_LAND = 215
  QM_EV_WHITE2013_LAND = 216
  QM_EV_RARECARD_LAND = 217
  QM_EV_XMAS2013_LAND_A = 219
  QM_EV_XMAS2013_LAND_B = 220
  QM_EV_NEWYEAR2014_LAND = 220
  QM_EV_ACOLYTE2014_LAND = 221
  QM_EV_ABYSS_LAND = 222
  QM_EV_SUMMER2014_LAND = 223
  QM_EV_4th_LAND = 224
  QM_EV_INQUISITOR = 225
  QM_EV_XMAS2014_LAND = 226
  QM_EV_201504_LAND = 227
  QM_EV_201508_LAND = 228
  QM_EV_XMAS2015_LAND = 229
  QM_EV_201601_LAND = 230
  QM_EV_WHITE2016_LAND = 231
  QM_EV_201605_LAND = 232
  QM_EV_201701_LAND = 233
  QM_EV_201702_LAND = 234
  QM_EV_201703_LAND = 235
  QM_EV_201707_LAND = 236

  QM_EV_INFINITE_TOWER = 991 # By_K2 (무한의탑)

  # レアカード取得クエスト
  QM_RARE_LAND = 1000
  QM_RARE_LAND2 = 1001

  # クエストの状態
  QS_NEW = 0                    # 新規
  QS_UNSOLVE = 1                # 未解決
  QS_INPROGRESS = 2             # 進行中
  QS_SOLVED = 3                 # 解決
  QS_PENDING = 4                # 未決（まだ見つけてない）
  QS_FAILED = 5                 # 失敗
  QS_PRESENTED = 6              # プレゼントされた

  # クエスト探索時間
  QFT_SET = [
    0, # 0分
    3 * 60,                  # 3分
    10 * 60,                 # 10分
    30 * 60,                 # 30分
    60 * 60,                 # 1時間
    120 * 60,                # 2時間
    240 * 60,                # 4時間
    480 * 60,                # 8時間
    960 * 60,                # 16時間
    1440 * 60,               # 1日
    4320 * 60,               # 3日
  ]

  # クエストが変化するアバター衣装ID
  QEV_XMAS_PART_ID = 200

  # 変化するクエストのレアリティの下限
  QEV_RARITY = 6

  # クエストの進行度
  #  QP_PROGRESS =

  # クエストの割り当て方式
  QUEST_ALLOC_TYPE_NONE = 0
  QUEST_ALLOC_TYPE_COST = 1

  # トレジャーの割り当て方式
  TREASURE_ALLOC_TYPE_NONE = 0
  TREASURE_ALLOC_TYPE_COST = 1

  # CPUマッチの割り当て方式
  CPU_MATCHING_TYPE_NONE = 0
  CPU_MATCHING_TYPE_COST = 1

  # 2012クリスマスイベントクエストID
  QE_CHRISTMAS2012_START_ID = 20_395
  QE_CHRISTMAS2012_END_ID   = 20_494

  # 2014クリスマスイベントクエストID
  QE_CHRISTMAS2014_START_ID = 20_919
  QE_CHRISTMAS2014_END_ID   = 20_946

  # 2015/06イベント、プレゼント不可クエストIDリスト
  #  QUEST_EVENT_QUEST_LIST = Range.new(21064,21074,21088).to_a
  #  QUEST_EVENT_QUEST_LIST = [21125,21126,21127]

  # 2015/12イベント、プレゼント不可クエストIDリスト
  #  QUEST_EVENT_QUEST_LIST = Range.new(21128,21159).to_a

  # プレゼント不可クエストIDリスト
  QUEST_EVENT_QUEST_LIST = [
    21_172, 21_173, 21_174, 21_175, 21_176, 21_177, 21_178, 21_179, 21_180, 21_192, 21_193, 21_194, 21_206, 21_207, 21_208, 21_209, 21_210, 21_211, 21_212, 21_213, 21_214, # 2016/04イベント
    21_363, 21_364, 21_365, 21_366, 21_367, 21_368, 21_369, 21_370, 21_371, 21_372, 21_373, 21_374, 21_375, 21_376, # 2017/01イベント
    21_393, 21_394, 21_395, 21_396, 21_397, 21_398, 21_399, 21_400, 21_401, 21_402, 21_403, 21_404, 21_405, 21_406, 21_407, 21_408, 21_409, 21_410, 21_411, 21_412, 21_413,   # 2017/04イベント
    21_414, 21_415, 21_416, 21_417, 21_418, 21_419, 21_425, 21_426, 21_427, 21_433, 21_434, 21_435, 21_440, 21_441, 21_442, 21_448, 21_449, 21_450, 21_451, 21_452, 21_453,   # 2017/04イベント
    21_454, 21_455, 21_456, 21_457, 21_458, 21_459, 21_460, 21_461, 21_462, 21_463, 21_464, 21_465, 21_466, 21_467, 21_468, 21_469, 21_470, 21_471, 21_472, 21_473, 21_474,   # 2017/04イベント
    21_475, 21_476, 21_477, 21_478, 21_479, 21_480, 21_481, 21_482, 21_483, 21_484, 21_485, 21_486, 21_487, 21_488, 21_489, 21_490, # 2017/06イベント
    21_491, 21_492, 21_493, 21_494, 21_495, 21_496, 21_497, 21_498, 21_499, 21_500, 21_501, 21_502, 21_503, 21_504, 21_505, 21_506, 21_507, 21_508, 21_509, 21_510, 21_511, # 2017/06イベント
    21_512, 21_513, 21_514, 21_515, 21_516, 21_517, 21_518, 21_519, 21_520, 21_521, 21_522, 21_523, 21_524, 21_525, 21_526, 21_527, 21_528, 21_529, 21_530, # 2017/06イベント
    21_531, 21_532, 21_533, 21_534, 21_535, 21_536, 21_537, 21_538, 21_539, 21_540, 21_541, 21_542, 21_543, 21_544, 21_545, 21_546, 21_547, # 2017/07イベント
  ]

  # プレゼントしたアバター名の無効文字
  QUEST_PRESENT_AVATAR_NAME_NIL = 'n'.force_encoding('UTF-8')

  # ============== ログインボーナス関連定数 ==================

  # By_K2 (무한의탑 입장권(기간제))
  TOWER_LOGIN_BONUS_FLAG = false
  TOWER_LOGIN_BONUS = [TG_AVATAR_ITEM, 0, 102]

  # By_K2 (무한의탑 특정 층 보상)
  TOWER_FLOOR_71_REWARD = [TG_AVATAR_ITEM, 0, 39]
  TOWER_FLOOR_61_REWARD = [TG_AVATAR_ITEM, 0, 38]
  TOWER_FLOOR_51_REWARD = [TG_CHARA_CARD, 0, 10_012]
  TOWER_FLOOR_41_REWARD = [TG_AVATAR_PART, 0, 152]
  TOWER_FLOOR_31_REWARD = [TG_AVATAR_PART, 0, 153]
  TOWER_FLOOR_21_REWARD = [TG_AVATAR_PART, 0, 154]
  TOWER_FLOOR_11_REWARD = [TG_AVATAR_ITEM, 0, 21]

  # ============== デュエル関連定数 ==================
  # DuelServerState

  DSS_OK = 0                  # 接続可能
  DSS_DOWN = 1                # ダウン中

  # 対戦ルールでの行動力消費
  DUEL_AP  = [2, 5]

  # 対戦ルールでの行動力消費
  FRIEND_DUEL_AP  = [1, 3]

  # 特殊対戦ルールでの行動力消費
  RADDER_DUEL_AP  = [1, 1]

  # 特殊対戦ルールのデッキ経験値倍率
  RADDER_DUEL_DECK_EXP_POW = 3
  # 特殊対戦ルールのカードボーナス倍率
  RADDER_DUEL_CARD_BONUS_POW = 2

  # 対戦ルールでの行動力消費
  DUEL_OPTION_FREE = 0
  DUEL_OPTION_FRIEND = 1

  # DUEL_BONUS
  DUEL_BONUS_FIRST_ATTACK   = 1 # 最初に攻撃をした方にボーナス＋１
  DUEL_BONUS_STRIKE_KILL    = 2 # 一発で倒した場合(星はHPによる)
  DUEL_BONUS_SURVIVER       = 3 # HP１で敵を倒す星は＋３固定(相手キャラが増えれば＋１)
  DUEL_BONUS_FEAT           = 4 # 必殺技を使うゴトに+1
  #  DUEL_BONUS_OVER_KILL      = 5 # HP分マイナスにしたときに（MAXHPによる）

  # 無料デュエル回数
  FREE_DUEL_COUNT = 3

  # クエストプレゼントボーナス（相手がクリアしてくれた時のお返しgem and avatar_item）
  SEND_QUEST_BONUS = [
    { TG_GEM: 5 }, # 0
    { TG_GEM: 10 },        # 1 5
    { TG_GEM: 20 },        # 2 10
    { TG_GEM: 30 },        # 3 10
    { TG_GEM: 50 },        # 4 20
    { TG_GEM: 80 },        # 5 30
    { TG_GEM: 120 },       # 6 40
    { TG_GEM: 180 },       # 7 60
    { TG_GEM: 250 },       # 8 70
    { TG_GEM: 350 },       # 9 100
    { TG_GEM: 500 },       # 10 150
  ]

  # ChannelRules
  CRULE_FREE     = 0
  CRULE_LOW      = 1
  CRULE_HIGH     = 2
  CRULE_NEWBIE   = 3
  CRULE_RADDER   = 4
  CRULE_COST_A   = 5 # CRULE_COST_A 2週間毎に変更
  CRULE_COST_B   = 6 # COST75 未使用
  CRULE_EVENT    = 10

  # ====== MessageDialogue関連 =======
  DUEL_MSGDLG_START            = 0   # XXXさんとの対戦を開始します
  DUEL_MSGDLG_WATCH_START      = 1   # XXXさん対ZZZさんのバトル観戦をします
  DUEL_MSGDLG_DUEL_START       = 2   # Duel スタート
  DUEL_MSGDLG_M_DUEL_START     = 3   # Multi Duel スタート
  DUEL_MSGDLG_INITIATIVE       = 4   # XXXがイニシアチブをとりました
  DUEL_MSGDLG_DISTANCE         = 5   # 距離がXになりました
  DUEL_MSGDLG_CHANGE_CHARA     = 6   # 戦闘キャラを変更しました
  DUEL_MSGDLG_BTL_POINT        = 7   # 攻撃はなし or 攻撃力決定 X
  DUEL_MSGDLG_BTL_RESULT       = 8   # XXXの攻撃はキャンセル
  DUEL_MSGDLG_TURN_END         = 9   # ターン X の終了
  DUEL_MSGDLG_SPECIAL          = 10  # (赤い柘榴の発動内容)
  DUEL_MSGDLG_STATE            = 11  # (付加される状態内容)
  DUEL_MSGDLG_DMG_FOR_BOSS     = 12  # XXXさんが、ZZZにxダメージを与えた
  DUEL_MSGDLG_HEAL_BOSS        = 13  # ZZZがx、回復した
  DUEL_MSGDLG_SUM_DMG_FOR_BOSS = 14  # 皆さんの攻撃でZZZに合計xダメージを与えました
  DUEL_MSGDLG_RAID_SCORE       = 15  # SCORE:XXX
  DUEL_MSGDLG_TRAP             = 16  # XXXにトラップ効果発動
  DUEL_MSGDLG_TRAP_ARLE        = 17  # XXXにトラップ効果発動, 手札を破棄
  DUEL_MSGDLG_TRAP_INSC        = 18  # 結界の効果により、XXXは無敵状態になりました
  DUEL_MSGDLG_LITTLE_PRINCESS  = 19  # リトルプリンセスの効果により、ダメージが無効化された
  DUEL_MSGDLG_CRIMSON_WITCH    = 20  # 深紅の魔女の効果により、ダメージが2倍になった
  DUEL_MSGDLG_AVOID_DAMAGE     = 21  # XXX は Y のダメージを回避しました
  DUEL_MSGDLG_CONSTRAINT       = 22  # XXX は A,B,C禁止状態になりました
  DUEL_MSGDLG_WEAPON_STATUS_UP = 23  # XXX の武器ステータスが向上しました
  DUEL_MSGDLG_SWORD_DEF_UP     = 24  # XXX の近距離における防御性能が向上しました
  DUEL_MSGDLG_ARROW_DEF_UP     = 25  # XXX の遠距離における防御性能が向上しました
  DUEL_MSGDLG_DOLL_ATK         = 26  # ヌイグルミによる追加攻撃
  DUEL_MSGDLG_DOLL_CRASH       = 27  # ヌイグルミ破壊

  # ====== TRAP種別 =======
  TRAP_ARLE = 278
  TRAP_INSC = 279

  #
  # ============== アチーブメント定数 ==================
  #
  # 実績タイプ
  ACHIEVEMENT_TYPE_AVATAR = 0
  ACHIEVEMENT_TYPE_DUEL   = 1
  ACHIEVEMENT_TYPE_QUEST  = 2
  ACHIEVEMENT_TYPE_FRIEND = 3
  ACHIEVEMENT_TYPE_EVENT  = 4

  # 実績の状態
  ACHIEVEMENT_STATE_START  = 0
  ACHIEVEMENT_STATE_FINISH = 1
  ACHIEVEMENT_STATE_FAILED = 2

  # 実績条件タイプ
  ACHIEVEMENT_COND_TYPE_LEVEL             = 0
  ACHIEVEMENT_COND_TYPE_DUEL_WIN          = 1
  ACHIEVEMENT_COND_TYPE_QUEST_CLEAR       = 2
  ACHIEVEMENT_COND_TYPE_FRIEND_NUM        = 3
  ACHIEVEMENT_COND_TYPE_ITEM_NUM          = 4
  ACHIEVEMENT_COND_TYPE_HALLOWEEN         = 5
  ACHIEVEMENT_COND_TYPE_CHARA_CARD        = 6
  ACHIEVEMENT_COND_TYPE_CHARA_CARD_DECK   = 7
  ACHIEVEMENT_COND_TYPE_QUEST_NO_CLEAR    = 8
  ACHIEVEMENT_COND_TYPE_GET_RARE_CARD     = 9
  ACHIEVEMENT_COND_TYPE_DUEL_CLEAR        = 10
  ACHIEVEMENT_COND_TYPE_QUEST_PRESENT     = 11
  ACHIEVEMENT_COND_TYPE_RECORD_CLEAR      = 12
  ACHIEVEMENT_COND_TYPE_ITEM              = 13
  ACHIEVEMENT_COND_TYPE_ITEM_COMPLETE     = 14
  ACHIEVEMENT_COND_TYPE_ITEM_CALC         = 15
  ACHIEVEMENT_COND_TYPE_ITEM_SET_CALC     = 16
  ACHIEVEMENT_COND_TYPE_QUEST_POINT       = 17
  ACHIEVEMENT_COND_TYPE_GET_WEAPON        = 18
  ACHIEVEMENT_COND_TYPE_QUEST_ADVANCE     = 19
  ACHIEVEMENT_COND_TYPE_FIND_PROFOUND     = 20
  ACHIEVEMENT_COND_TYPE_RAID_BATTLE_CNT   = 21
  ACHIEVEMENT_COND_TYPE_MULTI_QUEST_CLEAR = 22
  ACHIEVEMENT_COND_TYPE_INVITE_COUNT      = 23
  ACHIEVEMENT_COND_TYPE_RAID_BOSS_DEFEAT  = 24
  ACHIEVEMENT_COND_TYPE_RAID_ALL_DAMAGE   = 25
  ACHIEVEMENT_COND_TYPE_CREATED_DAYS      = 26
  ACHIEVEMENT_COND_TYPE_EVENT_POINT       = 27
  ACHIEVEMENT_COND_TYPE_EVENT_POINT_CNT   = 28
  ACHIEVEMENT_COND_TYPE_GET_PART          = 29
  ACHIEVEMENT_COND_TYPE_DAILY_CLEAR       = 30
  ACHIEVEMENT_COND_TYPE_OTHER_RAID        = 31
  ACHIEVEMENT_COND_TYPE_USE_ITEM          = 32
  ACHIEVEMENT_COND_TYPE_SELF_RAID         = 33
  ACHIEVEMENT_COND_TYPE_OTHER_DUEL        = 34

  NOTICE_TYPE_LOGIN           = 0
  NOTICE_TYPE_ACHI_SUCC       = 1
  NOTICE_TYPE_ACHI_NEW        = 2
  NOTICE_TYPE_VANISH_PART     = 3
  NOTICE_TYPE_FRIEND_COME     = 4
  NOTICE_TYPE_ITEM_PRESENT    = 5
  NOTICE_TYPE_QUEST_PRESENT   = 6
  NOTICE_TYPE_RETURN_CARD     = 7
  NOTICE_TYPE_INVITE_SUCC     = 8
  NOTICE_TYPE_AD              = 9
  NOTICE_TYPE_QUEST_SUCC      = 10
  NOTICE_TYPE_COMEBK_SUCC     = 11
  NOTICE_TYPE_COMEBKED_SUCC   = 12
  NOTICE_TYPE_SALE_START      = 13
  NOTICE_TYPE_ROOKIE_START    = 14
  NOTICE_TYPE_GET_PROFOUND    = 15
  NOTICE_TYPE_FIN_PRF_WIN     = 16
  NOTICE_TYPE_FIN_PRF_REWARD  = 17
  NOTICE_TYPE_FIN_PRF_RANKING = 18
  NOTICE_TYPE_FIN_PRF_FAILED  = 19
  NOTICE_TYPE_3_ANNIVERSARY   = 20
  NOTICE_TYPE_APOLOGY         = 21
  NOTICE_TYPE_NEW_YEAR        = 22
  NOTICE_TYPE_INVITED_SUCC    = 23
  NOTICE_TYPE_UPDATE_NEWS = 24
  NOTICE_TYPE_CLEAR_CODE               = 25
  NOTICE_TYPE_GET_SELECTABLE_ITEM      = 26

  # end_atを設定する場合のタイプ
  ACHIEVEMENT_END_AT_TYPE_NONE = 0
  ACHIEVEMENT_END_AT_TYPE_DAY  = 1
  ACHIEVEMENT_END_AT_TYPE_HOUR = 2

  # 初心者レコードの開始ＩＤ
  ROOKIE_RECORD_START = 180
  # 初心者用クエストアチーブメント定数
  ROOKIE_QUEST_01     = [[1], [180, 181, 182]]

  # 期間限定クエストアチーブメント定数
  EVENT_QUEST_01  = [[10_428, 10_429, 10_430, 10_431, 10_432, 21_475, 21_476, 21_477, 21_478, 21_479, 21_480, 21_481, 21_482, 21_483, 21_484, 21_485, 21_486, 21_487, 21_488, 21_489, 21_490, 21_491, 21_492, 21_493, 21_494, 21_495, 21_496, 21_497, 21_498, 21_499, 21_500, 21_501, 21_502, 21_503, 21_504, 21_505, 21_506, 21_507, 21_508, 21_509, 21_510, 21_511, 21_512, 21_513, 21_514, 21_515, 21_516, 21_517, 21_518, 21_519, 21_520, 21_521, 21_522, 21_523, 21_524, 21_525, 21_526, 21_527, 21_528, 21_529, 21_530], [1184, 1185, 1186, 1187, 1188, 1189, 1190, 1191, 1192, 1193]] # 2017/06イベント
  EVENT_QUEST_02  = [[21_209, 21_210, 21_211], [957]] # 2016/4イベント
  EVENT_QUEST_03  = [[21_212, 21_213, 21_214], [958]] # 2016/4イベント
  EVENT_QUEST_04  = [[21_306, 21_307, 21_308], [1047]] # 2016/10月イベント
  EVENT_QUEST_05  = [[21_315, 21_316, 21_317], [1048]] # 2016/10月イベント
  EVENT_QUEST_06  = [[21_327, 21_328, 21_329], [1049]] # 2016/10月イベント
  EVENT_QUEST_07  = [[21_342, 21_343, 21_344], [1050]] # 2016/10月イベント
  EVENT_QUEST_08  = [[21_360, 21_361, 21_362], [1051]] # 2016/10月イベント
  EVENT_QUEST_09  = [[21_088], [703]] # 2015/6月イベント
  EVENT_QUEST_10  = [[21_089, 21_090, 21_091], [718, 742, 754, 762, 774]] # 2015/08イベント Aクエスト（ルディア）
  EVENT_QUEST_11  = [[21_092, 21_093, 21_094], [722, 734, 738, 766, 770]] # 2015/08イベント Bクエスト（ヴィルヘルム）
  EVENT_QUEST_12  = [[21_095, 21_096, 21_097], [726, 730, 746, 750, 758]] # 2015/08イベント Cクエスト（メリー）
  EVENT_QUEST_13  = [[21_125, 21_126, 21_127], [835]] # 2015/10月イベント
  EVENT_QUEST_14  = [[10_388, 10_389, 10_390, 10_391, 10_392, 21_146, 21_147, 21_148, 21_149, 21_150, 21_151, 21_152, 21_153, 21_154, 21_155, 21_156, 21_157, 21_158, 21_159], [863, 864, 865, 866, 867]] # 2016/01イベント
  EVENT_QUEST_15  = [[50_000], [788]] # 人気投票クエストレコード1
  EVENT_QUEST_16  = [[50_001], [789]] # 人気投票クエストレコード2
  EVENT_QUEST_17  = [[50_002], [790]] # 人気投票クエストレコード3
  EVENT_QUEST_18  = [[50_003], [791]] # 人気投票クエストレコード4
  EVENT_QUEST_19  = [[50_004], [792]] # 人気投票クエストレコード5
  EVENT_QUEST_20  = [[50_005], [793]] # 人気投票クエストレコード6
  EVENT_QUEST_21  = [[50_006], [794]] # 人気投票クエストレコード7
  EVENT_QUEST_22  = [[50_007], [795]] # 人気投票クエストレコード8
  EVENT_QUEST_23  = [[50_008], [796]] # 人気投票クエストレコード9
  EVENT_QUEST_24  = [[50_009], [797]] # 人気投票クエストレコード10
  EVENT_QUEST_25  = [[21_389, 21_390, 21_391, 21_392, 21_393, 21_394, 21_395, 21_396, 21_397, 21_398, 21_399, 21_400, 21_401, 21_402, 21_403, 21_404, 21_405, 21_406, 21_407, 21_408, 21_409, 21_410, 21_411, 21_412, 21_413, 21_414, 21_415, 21_416, 21_417, 21_418, 21_419, 21_420, 21_421, 21_422, 21_423, 21_424, 21_425, 21_426, 21_427, 21_428, 21_429, 21_430, 21_431, 21_432, 21_433, 21_434, 21_435, 21_436, 21_437, 21_438, 21_439, 21_440, 21_441, 21_442, 21_443, 21_444, 21_445, 21_446, 21_447, 21_448, 21_449, 21_450, 21_451, 21_452, 21_453, 21_454, 21_455, 21_456, 21_457, 21_458, 21_459, 21_460, 21_461, 21_462, 21_463, 21_464, 21_465, 21_466, 21_467, 21_468, 21_469, 21_470, 21_471, 21_472, 21_473, 21_474], [1149]] # 2017/04イベント
  EVENT_QUEST_26  = [[21_451, 21_452, 21_453], [1162]] # 1162 黒衣の城に現れたシェリの影を倒す
  EVENT_QUEST_27  = [[21_454, 21_455, 21_456], [1163]] # 1163 黒衣の城に現れたフリードリヒの影を倒す
  EVENT_QUEST_28  = [[21_457, 21_458, 21_459], [1164]] # 1164 黒衣の城に現れたスプラートの影を倒す
  EVENT_QUEST_29  = [[21_460, 21_461, 21_462], [1165]] # 1165 黒衣の城に現れたリーズの影を倒す
  EVENT_QUEST_30  = [[21_463, 21_464, 21_465], [1166]] # 1166 黒衣の城に現れたC.C.の影を倒す
  EVENT_QUEST_31  = [[21_472, 21_473, 21_474], [1167]] # 1167 黒衣の城に現れたギュスターヴの影を倒す
  EVENT_QUEST_32  = [[21_448, 21_449, 21_450], [1168]] # 1168 黒衣の城に現れたグリュンワルドの影を倒す
  EVENT_QUEST_33  = [[21_466, 21_467, 21_468], [1169]] # 1169 黒衣の城に現れたタイレルの影を倒す
  EVENT_QUEST_34  = [[21_469, 21_470, 21_471], [1170]] # 1170 黒衣の城に現れたヴィルヘルムの影を倒す
  EVENT_QUEST_35  = [[20_999, 21_000, 21_001, 21_002, 21_003, 21_004, 21_005, 21_006, 21_007, 21_008, 21_009, 21_010, 21_011, 21_012, 21_013, 21_014, 21_015, 21_016, 21_017, 21_018, 21_019, 21_020, 21_021, 21_022, 21_023, 21_024, 21_025, 21_026, 21_027, 21_028, 21_029, 21_030, 21_031], [675, 676, 677]] # 「バックベアード」レコード

  EVENT_QUEST_FRIEND_ACHIEVEMENT_ID = 253

  # 期間限定デュエルアチーブメント定数
  EVENT_DUEL_01  = [[0, 1, 2], [1205]]
  EVENT_DUEL_02  = [[0, 1, 2], [252]]
  EVENT_DUEL_03  = [[0, 1, 2], [140]]
  EVENT_DUEL_04  = [1084, 1085, 1086] # 低レベルアバター（Lv20以下）とデュエルする
  EVENT_DUEL_05  = [1087] # 低レベルアバター（Lv20以下）がデュエルする

  # 低レベルアバター（Lv20以下）
  LOW_AVATAR_DUEL_RECORD_LV = 20

  EVENT_DUEL_3VS3_ACHIEVEMENT_ID = 1183
  EVENT_DUEL_FRIEND_ACHIEVEMENT_ID = 264

  # チャンネルルール依存のレコード定数
  DUEL_RULE_ACHIEVEMENTS = {
    CRULE_FREE => [],
    CRULE_LOW => [],
    CRULE_HIGH => [],
    CRULE_NEWBIE => [],
    CRULE_RADDER => [1002, 1130, 1146],
    CRULE_COST_A => [1001, 1131, 1147],
    CRULE_COST_B => [1001],
    CRULE_EVENT => []
  }

  # 期間限定イベントデュエルアチーブメント定数
  EVENT_CPU_DUEL_01 = [[0], [232, 233, 234]]

  # キャラ人気投票関連アチーブメント定数
  CHATA_VOTE_ACHIEVEMENT_IDS = [302, 303]

  # 週間デュエルアチーブメントID
  WEEK_DUEL_ACHIEVEMENT_IDS  = [288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301]
  # 週間クエストアチーブメントID
  WEEK_QUEST_ACHIEVEMENT_IDS = [429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442]
  # デイリーアチーブメントクリア判定アチーブメントID
  DAILY_ACHIEVEMENT_CLEAR_IDS = [925]

  # デイリーアチーブメントID
  DAILY_ACHIEVEMENT_IDS = [890, 891, 892, 942, 983, 984, 985, 986, 1000, 1001, 1002, 1031, 1032, 1047, 1048, 1049, 1050, 1051, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1089, 1090, 1091, 1101, 1102, 1103, 1104, 1105, 1129, 1130, 1131, 1145, 1146, 1147, 1149, 1183, 1194, 1205]
  # 出現条件ありのデイリーアチーブメントID
  CONDITIONS_DAILY_ACHIEVEMENT_IDS = {
    #    1046 => [1047,1048,1049,1050,1051]
    1145 => [1146, 1147]
  }

  # 炎の聖女用クエストアチーブメント定数
  GODDESS_OF_FIRE_QUEST_01 = [[973], [415]]
  GODDESS_OF_FIRE_QUEST_02 = [[974], [416]]
  GODDESS_OF_FIRE_QUEST_03 = [[975], [417]]

  # 渦関連レコード
  FIND_PROFOUND_01  = [[1000, 1010, 1012, 1014, 2000, 2001, 3000, 3011], (457..460).to_a]
  FIND_PROFOUND_02  = [[1001, 1011, 1013, 1015, 2002, 2003, 3001, 3012], (461..464).to_a]
  RAID_BTL_CNT_01   = [[1000, 1010, 1012, 1014, 2000, 2001, 3000, 3011], (473..476).to_a]
  RAID_BTL_CNT_02   = [[1001, 1011, 1013, 1015, 2002, 2003, 3001, 3012], (477..480).to_a]
  RAID_BTL_CNT_03   = [1031]
  RAID_BTL_CNT_PRF_IDS = (1001..1004).to_a.concat((2001..2009).to_a.concat((3001..3008).to_a))
  ALL_RAID_BTL_CNT_IDS = (481..485).to_a
  PRF_ALL_DMG_CHECK_IDS = [890, 891, 892, 986, 1090]
  PRF_OTHER_RAID_BTL_CHECK_ID = [782]
  PRF_SELF_PRF_CLEAR_CHECK_ID = [943, 985]

  # 渦イベント関連レコード
  EVENT_PRF_IDS_01 = [2034, 2035, 2036, 2037, 3023, 3024, 3026, 3027]
  EVENT_PRF_SET_01 = [EVENT_PRF_IDS_01, [550, 551, 552]]

  # 招待人数レコード
  INVITE_RECORD_IDS = [490, 491, 492, 689, 690, 691, 692, 693]

  # 2014深淵の書イベントレコード
  EVENT_QUEST_PRESENT_2014_RECORD = [[20_835, 20_836, 20_837, 20_838, 20_839, 20_840, 20_841, 20_842, 20_843, 20_844, 20_845, 20_846, 20_847, 20_848, 20_849, 20_850, 20_851, 20_852, 20_853, 20_854], (494..498).to_a]

  # 201408イベント関連(加算レコードIDは「イベントランキング定数」に記載)
  EVENT_1408_RECORD_IDS = (529..534).to_a # レコードIDリスト
  # レコード条件クエストID：取得ポイント
  EVENT_1408_QUEST_IDS = {
    20_888 => 10, 20_889 => 20, 20_890 => 30, 20_891 => 40, 20_892 => 50,
    10_351 => 60, 10_352 => 70, 10_353 => 80, 10_354 => 90, 10_355 => 100
  }
  # ポイント増加特定キャラIDS
  EVENT_1408_ADD_POINT_CHARA_IDS = [9, 11, 16, 4011, 4016]
  EVENT_1408_POINT_COEFFICIENT   = 2 # 特定キャラの場合2倍

  # 201412イベント関連
  EVENT_201412_RECORD_IDS = { 1 => [629], 2 => [630], 3 => [631] }
  EVENT_201412_CHECK_INTARVAL = 58 * 30 # チェック間隔
  EVENT_201412_RATE = 10 # N分の1

  # 201701イベント関連
  EVENT_201701_RECORD_IDS = { 1 => [1101], 2 => [1102], 3 => [1103], 4 => [1104], 5 => [1105] }

  # パーツ取得チェック
  EVENT_GET_PART_01 = [[555], [696]]
  EVENT_GET_PART_02 = [[640], [860]]
  EVENT_GET_PART_03 = [[641], [861]]

  # アイテム使用レコードチェック
  EVENT_USE_ITEM_RECORD_ID = [[361, 362, 363, 364, 365], [984]]

  # 人気投票イベント
  EVENT_CHARA_VOTE_QUEST_IDS  = (10_001..10_387).to_a
  EVENT_CHARA_VOTE_RECORD_IDS = [798, 799, 800, 801, 802, 803, 804, 805, 806, 807]

  # 対戦相手カウントレコード
  RECORD_OTHER_AVATAR_DUEL_IDS = [822, 823, 824, 825]
  # 複数のアバターとのDuel記録期間(1ヶ月)
  RECORD_OTHER_AVATAR_DUEL_CACHE_TIME = 60 * 60 * 24 * 30

  # 使用済み含むアイテム所持数チェックレコード
  EVENT_ITEM_FULL_CHECK_IDS = [[379], [851, 852, 853, 854, 855]]

  #
  # ============== エラーコード定数 ==================
  #

  ERROR_AP_LACK                 = 1 # APが足りません
  ERROR_NO_CURRENT_DECK         = 2 # カレントデッキがありません
  ERROR_NO_RULE_MATCH           = 3 # 現在のルールにマッチしていません
  ERROR_GAME_QUIT               = 4 # 相手がゲームを放棄しました。相手をAIに切り替えます
  ERROR_GAME_ABORT              = 5 # ゲームを中断します
  ERROR_NOT_EXIST_INVETORY      = 6 # カードを持っていません

  ERROR_DOUBLE_LOGIN            = 7 # 多重ログインの可能性があります。
  ERROR_LOCK_ACOUNT             = 8 # あなたのアカウントは現在ロックされています。

  ERROR_GAME_NOT_START          = 9 # 相手がゲームを放棄しました。ゲームを中断します

  ERROR_DECK_MAX                = 10 # デッキにこれ以上入れられません
  ERROR_NOT_ENOUGH_COLOR        = 11 # デッキに適合する色スロットがありません
  ERROR_RESTRICT_CHARA          = 12 # このキャラにこのカードは持たせられません
  ERROR_MAX_IN_DECK             = 13 # このカードのデッキ最大数を超えています。
  ERROR_SLOT_MAX                = 14 # カードはこれ以上セット出来ません。
  ERROR_NOT_EXIST_CHARA         = 15 # デッキにキラャ1カードが存在しない
  ERROR_NOT_EXIST_DECK          = 16 # デッキが存在しない
  ERROR_DECK_DUBBLE_CHARA       = 17 # デッキに同じキャラが存在している
  ERROR_DECK_UNKNOWN_CHARA      = 18 # デッキに入れることが出来ないカードが入っている

  ERROR_GEM_DEFICIT             = 20 # GEM不足で購入できません
  ERROR_CANT_EQUIP              = 21 # 装備できませんでした
  ERROR_PARTS_DUPE              = 22 # 取得済みのパーツです

  ERROR_DUEL_CREATE_ROOM        = 25 # ペナルティの為、部屋を作れません
  ERROR_DUEL_JOIN_ROOM          = 26 # ペナルティの為、部屋に入れません
  ERROR_DUEL_CREATE_ROOM_EVENT  = 27 # イベントの為、部屋を作れません
  ERROR_DUEL_JOIN_ROOM_EVENT    = 28 # イベントの為、部屋に入れません

  ERROR_MAX_QUEST               = 30 # クエストが所持MAXに達しているので取得できません
  ERROR_WRONG_QUEST_MAP_NO      = 31 # 不正なクエストマップ番号です
  ERROR_NOT_ENOUGH_LEVEL        = 32 # マップを取得するのにレベルが足りません

  ERROR_QUEST_INV_IS_NONE       = 40 # クエストインベントリが存在しません
  ERROR_QUEST_STATUS_WRONG      = 41 # クエストインベントリは開始できる状態ではない
  ERROR_DECK_IS_ALREADY_QUESTED = 42 # そのデッキはすでにクエストに出ている
  ERROR_NEXT_QUEST_LAMD_WRONG   = 43 # その場所へに到達できない

  ERROR_DUEL_WRONG_ROOM         = 50 # 部屋がない
  ERROR_DUEL_ALREADY_START      = 51 # 部屋はスタート済み
  ERROR_DUEL_SAME_IP            = 52 # 同じIPでは対戦できません
  ERROR_DUEL_RADDER_ERROR       = 53 # スタートできません
  ERROR_DUEL_COST_ERROR         = 54 # コストの限界値を越えています
  ERROR_DUEL_OPPONENT_LOGOUT    = 55 # 相手が離脱している為、ゲームを開始できません

  ERROR_FRIEND_APPLY            = 60 # そのプレイヤーにはフレンド申請出来ません
  ERROR_FRIEND_CONFIRM          = 61 # そのプレイヤーは許可できませんでした
  ERROR_FRIEND_DELETE           = 62 # そのプレイヤーは削除出来ません
  ERROR_FRIEND_OWN_MAX          = 63 # フレンド最大値に達していて、申請できません。
  ERROR_FRIEND_OTHER_MAX        = 64 # 相手のフレンド最大値に達していて申請できません。
  ERROR_BLOCK_APPLY             = 65 # そのプレイヤーはブロック出来ません
  ERROR_BLOCK_MAX               = 66 # ブロック出来る最大数に達しました

  ERROR_DRAW_LOT                = 70 # クジを引くのを失敗
  ERROR_ITEM_NOT_BOSS_FLAG      = 71 # 達成度がMAXに達していないので使えません
  ERROR_ITEM_NOT_EXIST          = 72 # アイテムが存在しない
  ERROR_COPY_CARD               = 73 # カード複製に失敗しました
  ERROR_ITEM_UNABLE_MAP         = 74 # 現在表示しているマップでは使用できません

  ERROR_SEND_QUEST              = 80 # クエストを友人に送るのに失敗しました
  ERROR_SEND_QUEST_WRONG_QUEST  = 81 # クエストを渡すことが出来ません
  ERROR_SEND_QUEST_MAX          = 82 # 送り先のクエストが満杯でした
  ERROR_SEND_QUEST_SAME_IP      = 83 # 同じIPの相手にはクエストを送ることが出来ません。
  ERROR_SEND_QUEST_NOT_SENDER   = 84 # このクエストは、元の持ち主以外に送ることはできません。
  ERROR_SEND_QUEST_EVENT_QUEST  = 85 # このクエストは、送ることが出来ません

  ERROR_EVENT_SERIAL_CODE       = 90 # 無効なシリアルまたはすでに取得済みです。

  ERROR_PRF_BOSS_NOT_EXIST      = 100 # Bossのデッキが存在しない
  ERROR_PRF_DATA_NOT_EXIST      = 101 # 渦Dataが存在しない
  ERROR_PRF_FINISHED            = 102 # 渦戦闘は終了している
  ERROR_PRF_NOT_EXIST           = 103 # 渦が存在しない
  ERROR_PRF_HAVE_MAX_OVER       = 104 # 所持限界に達している
  ERROR_PRF_INV_NOT_EXIST       = 105 # 渦インベントリが存在しない
  ERROR_DECK_IS_ALREADY_USED    = 106 # デッキが使用中
  ERROR_DECK_IS_DIFFERENT       = 107 # 選択してるデッキが違う
  ERROR_PRF_NOT_FINISHED        = 108 # 終了処理が終わってない
  ERROR_PRF_CANT_HASH_COPY      = 109 # 設定上コピーできない
  ERROR_PRF_MEMBER_LIMIT_OVER   = 110 # 人数制限オーバー
  ERROR_PRF_ALREADY_HAD         = 111 # 所持している
  ERROR_PRF_WAS_GIVE_UP         = 112 # ギブアップ済み

  #
  # ============== アクティビティ定数 ==================
  #

  ACTV_START = 1

  #
  # ============== チュートリアル進行定数 ==================
  #
  TUTE_TYPE_START         = 0
  TUTE_TYPE_START_QUEST   = 1
  TUTE_TYPE_START_BATTLE  = 2
  TUTE_TYPE_START_END     = 3

  TUTE_TYPE_BATTLE        = 4
  TUTE_TYPE_CHANGE        = 5
  TUTE_TYPE_HILOW         = 6
  TUTE_TYPE_EVENT         = 7

  TUTE_TYPE_ENTRANCE      = 8
  TUTE_TYPE_QUEST         = 9
  TUTE_TYPE_DECK          = 10
  TUTE_TYPE_DUEL          = 11
  TUTE_TYPE_ITEM          = 12
  TUTE_TYPE_SHOP          = 13

  #
  # ============== クエストプレゼントお返しアイテム ==================
  #
  QUEST_PRESENTS  = [1] # から一つ

  #
  # ============== 渦関係定数 ==================
  #

  # 渦の種類
  PRF_TYPE_EVENT  = 1
  PRF_TYPE_NORMAL = 2
  PRF_TYPE_MMO_EVENT = 3 # 運営が発生させる渦

  # 渦の状態定数
  PRF_ST_UNKNOWN = 0
  PRF_ST_BATTLE  = 1
  PRF_ST_FINISH  = 2
  PRF_ST_VANISH  = 3
  PRF_ST_VAN_DEFEAT = 4

  # 渦インベントリの状態定数
  PRF_INV_ST_NEW        = 0 # 新規
  PRF_INV_ST_UNSOLVE    = 1 # 未解決
  PRF_INV_ST_INPROGRESS = 2 # 進行中
  PRF_INV_ST_SOLVED     = 3 # 解決
  PRF_INV_ST_PENDING    = 4 # 未決（まだ見つけてない）
  PRF_INV_ST_FAILED     = 5 # 失敗
  PRF_INV_ST_PRESENTED  = 6 # プレゼントされた
  PRF_INV_ST_GIVE_UP    = 7 # ギブアップ

  # 報酬の取得状態
  PRF_INV_REWARD_ST_STILL   = 0 # 条件未達成
  PRF_INV_REWARD_ST_READY   = 1 # 取得可能
  PRF_INV_REWARD_ST_ALREADY = 2 # 取得済み

  # 報酬のタイプ
  PRF_TRS_TYPE_RANK     = 0 # ランク報酬
  PRF_TRS_TYPE_DEFEAT   = 1 # 撃破報酬
  PRF_TRS_TYPE_FOUND    = 2 # 発見報酬
  PRF_TRS_TYPE_ALL      = 3 # 参加報酬

  # Hashコピータイプ
  PRF_COPY_TYPE_ALL     = 0 # 制限なし
  PRF_COPY_TYPE_OWNER   = 1 # 発見者のみ
  PRF_COPY_TYPE_FRIENDS = 2 # 発見者＆発見者のFriendのみ

  # 個人所有できる渦の最大数
  PROFOUND_MAX = 10

  # 渦の終了時間ロスタイム
  PRF_CLOSE_LOSS_TIME = 60 * 1 # 1分

  # 渦マップ最大数
  PRF_MAP_ID_MAX = 12
  # 各マップの渦配置最大数
  PRF_POS_IDX_MAX = 10

  # 強制終了時のパターン定数
  PRF_FINISHED_NONE    = 0
  PRF_FINISHED_DEFEAT  = 1 # 撃破
  PRF_FINISHED_TIME_UP = 2 # 時間切れ

  # 渦のメッセージ定数
  PRF_MSGDLG_DAMAGE = 0
  PRF_MSGDLG_REPAIR = 1

  # 渦関連NoticeType
  PRF_NOTICE_TYPES = [
    NOTICE_TYPE_GET_PROFOUND,
    NOTICE_TYPE_FIN_PRF_WIN,
    NOTICE_TYPE_FIN_PRF_REWARD,
    NOTICE_TYPE_FIN_PRF_RANKING,
    NOTICE_TYPE_FIN_PRF_FAILED
  ]

  PRF_SCORE_ADD_BASIS = 100
  PRF_SCORE_RAND_BASIS = 10

  # キャッシュにデータを保存する時間
  PRF_CACHE_TTL = 60 * 60 * 1

  # 渦ボス撃破後の表示時間(10分)
  PRF_LOSSTIME_TTL = 60 * 10

  # 渦のランキング保存時間
  PRF_RANKING_CACHE_TTL = 60 * 1

  # 渦終了ランキングNoticeのCache保存時間(3日)
  PRF_RANK_NOTICE_CACHE_TIME = 60 * 60 * 24 * 3

  # Bossのパラメータ表示開始HP計算係数 半分を切ったら表示開始
  PRF_BOSS_NAME_VIEW_START_HP_VAL = 2

  # 渦参加時の加算スコア
  PRF_JOIN_ADD_SCORE = 0

  # 渦戦闘時のターン数ボーナス係数
  PRF_SCORE_TURN_BUNUS_RATIO = 10
  # 渦戦闘時の最大ターン数ボーナス(10ターン分ボーナス)
  PRF_SCORE_MAX_TURN_BUNUS = 10 * PRF_SCORE_TURN_BUNUS_RATIO

  # ヘルプ送信間隔
  RAID_HELP_SEND_TIME = 10

  # 渦イベント自動発生グループID
  RAID_EVENT_AUTO_CREATE_GROUP_ID = 9999

  # 進行中渦Hashのキャッシュ保持時間(2時間)
  PRF_PLAYING_HASH_CACHE_TTL = 60 * 60 * 2

  #
  # ============== レイド関連定数 ==================
  #
  RAID_FINDER_START_POINT_DEF = 10
  RAID_MEMBER_LIMIT_DEF = 100

  #
  # ============== イベントランキング定数 ==================
  #
  TOTAL_EVENT_RANKING_TYPE_FRIEND         = false # フレンド関連アイテムイベントランキング
  TOTAL_EVENT_RANKING_TYPE_ACHIEVEMENT    = false # レコード加算イベントランキングフラグ
  TOTAL_EVENT_RANKING_TYPE_ITEM_NUM       = false # アイテム個数算イベントランキングフラグ
  TOTAL_EVENT_RANKING_TYPE_ITEM_POINT     = false # アイテムポイントイベントランキングフラグ
  TOTAL_EVENT_RANKING_TYPE_PRF_ALL_DMG    = true  # 渦総合ダメージイベントランキングフラグ

  TOTAL_EVENT_RANKING_ACHIEVEMENT_ID = 528
  TOTAL_EVENT_RANKING_CNT_ITEM_IDS = [227, 228]
  TOTAL_EVENT_RANKING_POINT_ITEM_IDS = [130, 131, 132, 133]
  TOTAL_EVENT_RANKING_ITEM_POINT = { 130 => 1, 131 => 1, 132 => 1, 133 => 50 }

  #
  # ============== キャラ人気投票定数 ==================
  #
  CHARA_VOTE_ITEM_START_ID         = 402
  CHARA_VOTE_ITEM_END_ID           = 477

  CHARA_VOTE_ITEM_ID_LIST = Range.new(CHARA_VOTE_ITEM_START_ID, CHARA_VOTE_ITEM_END_ID).to_a

  #
  # ============== フレンド合算アイテム収集イベント定数 ==================
  #
  EVENT_WITH_FRIEND_ITEM_ID_START = 166
  EVENT_WITH_FRIEND_ITEM_ID_END   = 169
  EVENT_WITH_FRIEND_ITEM_ID_RANGE = Range.new(EVENT_WITH_FRIEND_ITEM_ID_START, EVENT_WITH_FRIEND_ITEM_ID_END)

  EVENT_ITEM_POINTS = { 166 => 1, 167 => 2, 168 => 10, 169 => 50 }
  FRIEND_COEFFICIENT = 10

  #
  # ============== Infectionコラボ定数 ==================
  #
  INFECTION_COLLABO_PRESENTS = [
    { type: TG_AVATAR_ITEM, id: 9, num: 5, sct_type: 0 },
    { type: TG_CHARA_CARD, id: 10_011, num: 1, sct_type: 0 },
    { type: TG_AVATAR_PART, id: 428, num: 1, sct_type: 0 },
  ]

  #
  # ============== クランプスクリック定数 ==================
  #
  CLAMPS_CLICK_PRESENT = [
    { type: TG_AVATAR_ITEM, id: 235, num: 1, sct_type: 0 },
  ]

  # ============== キャラクターグループ定数 ==================
  CHARA_GROUP_MEMBERS = {
    'regiment' => [
      1,
      2,
      3,
      4,
      5,
      8,
      10,
      13,
      14,
      24,
      25,
      54,
      58,
      62,
      66
    ],
    'lonsbrough' => [
      3,
      20,
      27,
      48
    ]
  }

  #
  # ============== クエストイベント定数 ==================
  #
  QUEST_TYPE_NORMAL     = 0
  QUEST_TYPE_EVENT      = 1
  QUEST_TYPE_TUTORIAL   = 2
  QUEST_TYPE_CHARA_VOTE = 3

  QUEST_TUTORIAL_ID = 2
  QUEST_TUTORIAL_MAP_START = 2008

  QUEST_EVENT_ID = 9
  QUEST_EVENT_MAP_START = 3026

  QUEST_CHARA_VOTE_ID = 4
  QUEST_CHARA_VOTE_MAP_START = 5000
  QUEST_CHARA_VOTE_MAP_END   = 5006 # キャラ人気投票クエストは初めから全て表示する為

  # クエストボス出現アイテム関連
  QUEST_AREA_MAP_LIST = {
    QUEST_TYPE_NORMAL => [
      [0, 1, 2],
      [3, 4, 5, 6, 7, 8, 9, 10],
      [11, 12, 13, 14, 15, 16, 17, 18],
      [19, 20, 21, 22, 23, 24, 25, 26],
      [27, 28, 29, 30, 31, 32, 33, 34],
      [35],
    ],
    QUEST_TYPE_EVENT => [
      [3026, 3027, 3028, 3029, 3030],
    ],
    QUEST_TYPE_TUTORIAL => [
      [2009, 2010, 2011, 2012, 2013],
    ],
    QUEST_TYPE_CHARA_VOTE => [
      [5001, 5002, 5003, 5004, 5005, 5006, 5007, 5008, 5009, 5010],
    ]
  }

  #
  # ============== 武器合成関連定数 ==================
  #
  WEAPON_TYPE_NORMAL     = 0
  WEAPON_TYPE_MATERIAL   = 1
  WEAPON_TYPE_CMB_WEAPON = 2

  COMB_BASE_TOTAL_MAX = 2
  COMB_ADD_TOTAL_MAX = 20

  COMB_EXP_ITEM_IDS = [5024, 5025, 5026, 5027, 5028, 5029]

  #
  # ============== デバッグコード定数 ==================
  #

  DEBUG_CODE_ENEMY_DAMEGE_10         = 0
  DEBUG_CODE_SELF_DAMAGE_1           = 1
  DEBUG_CODE_SET_LAST_TURN           = 2
  DEBUG_CODE_ALL_HP_REMAIN_1         = 3
  DEBUG_CODE_SELF_ALL_DAMAGE_1       = 4
end
